# St7SetPropertyCreepID

Assigns the creep definition to the specified property.

long St7SetPropertyCreepID(long uID, long Entity, long PropNum, long CreepID)

Input Parameters

uID

Strand7 model file ID.

Properties – Beams, Plates and Bricks

Entity

One of ptBEAMPROP, ptPLATEPROP or ptBRICKPROP.

PropNum

Property number.

CreepID

Creep layout ID or 0 for none.